Revit 2024 API
PreviewControl.UIView Property
The UI view representing the preview view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public UIView UIView { get; }
Visual Basic
Public ReadOnly Property UIView As UIView
	Get
Visual C++
public:
property UIView^ UIView {
	UIView^ get ();
}
Remarks
Use this handle to manipulate the zoom and pan of the view.
See Also
PreviewControl Class
Autodesk.Revit.UI Namespace